import { Category } from "./src/routes/types/types";

export const categories: Category[] = [
    {
        mcc: {
            numbers: [4011, 4131, 4304, 4411, 4415, 4418, 4457, 4468, 4511, 4582, 4722, 4784, 4789, 5962, 7011, 7519, 4111, 4112, 7032, 7033, 7512, 7513],
            ranges: [[3000, 3299], [3351, 3441], [3501, 3999]]
        },
        category: "Путешествия",
        id: 0
    },
    {
        mcc: {
            numbers: [4119, 5047, 5122, 5292, 5295, 5912, 5975, 5976, 5977, 7230, 7297, 7298, 8011, 8021, 8031, 8041, 8042, 8043, 8049, 8050, 8062, 8071, 8099],
            ranges: []
        },
        category: "Красота и медицина",
        id: 1
    },
    {
        mcc: {
            numbers: [5733, 5735, 5815, 5816, 5817, 5818, 5940, 5941, 5945, 5946, 5947, 5970, 5971, 5972, 5973, 7221, 7333, 7395, 7929, 7932, 7933, 7941, 7991, 7992, 7993, 7994, 7996, 7997, 7998, 7999, 8664],
            ranges: [[7911, 7922]]
        },
        category: "Развлечения и спорт",
        id: 2
    },
    {
        mcc: {
            numbers: [5811, 5812, 5813, 5814],
            ranges: []
        },
        category: "Кафе и рестораны",
        id: 3
    },
    {
        mcc: {
            numbers: [5297, 5298, 5300, 5311, 5331, 5399, 5411, 5412, 5422, 5441, 5451, 5462, 5499, 5715, 5921],
            ranges: []
        },
        category: "Продукты и супермаркеты",
        id: 4
    },
    {
        mcc: {
            numbers: [7829, 7832, 7841],
            ranges: []
        },
        category: "Кино",
        id: 5
    },
    {
        mcc: {
            numbers: [5172, 5511, 5531, 5532, 5533, 5541, 5542, 5983, 7511, 7523, 7531, 7534, 7535, 7538, 7542, 7549],
            ranges: []
        },
        category: "Авто и АЗС",
        id: 6
    },
    {
        mcc: {
            numbers: [5131, 5137, 5139, 5611, 5621, 5631, 5641, 5651, 5655, 5661, 5681, 5691, 5697, 5698, 5699, 5931, 5948, 5949, 7251, 7296],
            ranges: []
        },
        category: "Одежда и обувь",
        id: 7
    },
    {
        mcc: {
            numbers: [4121],
            ranges: []
        },
        category: "Такси",
        id: 8
    },
    {
        mcc: {
            numbers: [742, 5995],
            ranges: []
        },
        category: "Животные",
        id: 9
    },
    {
        mcc: {
            numbers: [2741, 5111, 5192, 5942, 5994],
            ranges: []
        },
        category: "Книги",
        id: 10
    },
    {
        mcc: {
            numbers: [5992, 5193],
            ranges: []
        },
        category: "Цветы",
        id: 11
    },
    {
        mcc: {
            numbers: [4812, 5045, 5722, 5732, 5997, 7379],
            ranges: []
        },
        category: "Бытовая техника",
        id: 12
    },
    {
        mcc: {
            numbers: [5172, 5541, 5542, 5983],
            ranges: []
        },
        category: "АЗС",
        id: 13
    },
    {
        mcc: {
            numbers: [5814],
            ranges: []
        },
        category: "Фастфуд",
        id: 14
    },
    {
        mcc: {
            numbers: [],
            ranges: []
        },
        category: "Другое",
        id: 15
    }
]
